// src/features/Terms/TermsPage.tsx

import React from 'react';
import Container from '@mui/material/Container';
import Paper from '@mui/material/Paper';
import Box from '@mui/material/Box'; 
import Layout from '../../shared/components/Layout';
import { useTheme } from '@mui/material/styles'; 


const termsOfServiceHtml = `
<h1>Умови використання</h1>
<p>Останнє оновлення: 01 травня 2025 року</p>
<p>Ці Умови використання ("Умови") регулюють Ваш доступ до Сервісу та його використання, включаючи бронювання квитків, перегляд трейлерів, а також будь-який контент, функції та послуги, що надаються на Вебсайті або через нього. Використовуючи Сервіс, Ви погоджуєтеся дотримуватися цих Умов. Якщо Ви не згодні з цими Умовами, Ви не можете використовувати Сервіс.</p>

<h2>Тлумачення та визначення</h2>
<h3>Тлумачення</h3>
<p>Слова, що починаються з великої літери, мають значення, визначені нижче. Ці визначення застосовуються незалежно від того, вжиті вони в однині чи множині.</p>

<h3>Визначення</h3>
<p>Для цілей цих Умов використання:</p>
<ul>
<li><strong>Обліковий запис</strong> — унікальний обліковий запис, створений для Вас, щоб бронювати квитки, переглядати трейлери або отримувати доступ до інших частин нашого Сервісу.</li>
<li><strong>Афілійована особа</strong> — організація, яка контролює, контролюється або перебуває під спільним контролем із стороною, де "контроль" означає володіння 50% або більше акцій, часток або інших цінних паперів, що дають право голосу для обрання директорів чи іншого керівного органу.</li>
<li><strong>Компанія</strong> (далі "Компанія", "Ми", "Нас" або "Наш" у цих Умовах) — це KinoAfisha.</li>
<li><strong>Контент</strong> — будь-який текст, зображення, відео (включаючи трейлери), відгуки чи інші матеріали, доступні на Сервісі, надані Нами або завантажені Користувачами.</li>
<li><strong>Країна</strong> — Україна.</li>
<li><strong>Пристрій</strong> — будь-який пристрій, який може отримати доступ до Сервісу, наприклад, комп’ютер, мобільний телефон або планшет.</li>
<li><strong>Сервіс</strong> — це Вебсайт.</li>
<li><strong>Вебсайт</strong> — це KinoAfisha, доступний за адресою <a href="http://localhost:5173/" rel="external nofollow noopener" target="_blank">http://localhost:5173/</a>.</li>
<li><strong>Ви</strong> — фізична особа, яка використовує Сервіс, або компанія чи інша юридична особа, від імені якої така особа використовує Сервіс.</li>
</ul>

<h2>Доступ до Сервісу</h2>
<h3>Ваші обов’язки</h3>
<p>Використовуючи Сервіс, Ви погоджуєтеся:</p>
<ul>
<li>Надавати точну, актуальну та повну інформацію під час створення Облікового запису, бронювання квитків або використання Сервісу.</li>
<li>Забезпечувати безпеку Вашого Облікового запису, зберігаючи конфіденційність даних для входу та негайно повідомляючи Нас про будь-яке несанкціоноване використання.</li>
<li>Дотримуватися всіх застосовних законів і правил під час бронювання квитків, перегляду трейлерів або взаємодії з Сервісом.</li>
</ul>

<h3>Бронювання квитків</h3>
<p>Ви можете бронювати квитки на кіносеанси через Сервіс. Усі бронювання підлягають таким умовам:</p>
<ul>
<li>Квитки є непередаваними і дійсні лише для вказаного сеансу, дати та часу.</li>
<li>Повернення або обмін квитків можливі лише відповідно до політики кінотеатру-партнера, зазначеної під час бронювання.</li>
<li>Ми не несемо відповідальності за скасування сеансів або зміни розкладу, спричинені кінотеатрами.</li>
</ul>

<h3>Заборонені дії</h3>
<p>Ви не можете використовувати Сервіс для незаконних або заборонених цими Умовами цілей. Ви погоджуєтеся не:</p>
<ul>
<li>Використовувати Сервіс для незаконних дій, таких як шахрайство з бронюванням, поширення піратських трейлерів або порушення прав інтелектуальної власності.</li>
<li>Намагатися отримати несанкціонований доступ до будь-якої частини Сервісу, інших Облікових записів або систем, підключених до Сервісу.</li>
<li>Публікувати, завантажувати чи поширювати Контент, який є наклепницьким, образливим, піратським або порушує права інших (наприклад, викладати трейлери без дозволу).</li>
<li>Використовувати автоматизовані системи (боти, скрипти) для масового бронювання квитків або збору даних із Сервісу без Нашого явного дозволу.</li>
<li>Втручатися в роботу Сервісу, зокрема шляхом введення вірусів або іншого шкідливого коду.</li>
</ul>

<h2>Контент</h2>
<h3>Ваш Контент</h3>
<p>Ви несете відповідальність за будь-який Контент, який завантажуєте, публікуєте чи поширюєте на Сервісі, наприклад, відгуки про фільми. Завантажуючи Контент, Ви надаєте Нам невиключну, всесвітню, безоплатну ліцензію на використання, відтворення, модифікацію та поширення цього Контенту виключно для цілей роботи та вдосконалення Сервісу.</p>
<p>Ви гарантуєте, що Ваш Контент не порушує застосовні закони чи права третіх осіб, включаючи права інтелектуальної власності або конфіденційності.</p>

<h3>Наш Контент</h3>
<p>Увесь Контент, наданий Компанією, включаючи трейлери, афіші, описи фільмів, текст, графіку та програмне забезпечення, є власністю Компанії, кінотеатрів-партнерів або їхніх ліцензіарів і захищений авторським правом, торговельними марками та іншими законами. Ви не можете відтворювати, поширювати чи створювати похідні роботи з Нашого Контенту, наприклад, копіювати трейлери, без Нашого письмового дозволу.</p>

<h2>Припинення доступу</h2>
<p>Ми можемо призупинити або припинити Ваш доступ до Сервісу на Наш розсуд, із повідомленням або без, якщо Ви порушите ці Умови, наприклад, шахраюватимете з бронюванням або поширюватимете піратський контент.</p>
<p>Після припинення доступу Ваше право використовувати Сервіс, зокрема бронювати квитки чи переглядати трейлери, припиняється негайно, і Ми можемо видалити Ваш Обліковий запис та пов’язаний Контент. Ви також можете припинити свій Обліковий запис у будь-який час, звернувшись до Нас.</p>

<h2>Обмеження відповідальності</h2>
<p>Сервіс надається на умовах "як є" та "за наявності". У межах, дозволених законом, Компанія відмовляється від усіх гарантій, явних чи неявних, включаючи гарантії комерційної придатності, придатності для певної мети та непорушення прав.</p>
<p>Компанія та її Афілійовані особи не несуть відповідальності за будь-які непрямі, випадкові, спеціальні, послідовні чи штрафні збитки, що виникають у зв’язку з Вашим використанням Сервісу, наприклад, через скасування сеансу чи технічні збої, навіть якщо Ми були попереджені про можливість таких збитків.</p>

<h2>Відшкодування</h2>
<p>Ви погоджуєтеся відшкодувати, захищати та звільнити від відповідальності Компанію, її Афілійованих осіб, посадових осіб, директорів, працівників і агентів від будь-яких претензій, зобов’язань, збитків або витрат (включаючи розумні гонорари адвокатів), що виникають у зв’язку з Вашим використанням Сервісу, Вашим Контентом або порушенням цих Умов.</p>

<h2>Зміни до цих Умов</h2>
<p>Ми можемо час від часу оновлювати ці Умови. Ми повідомимо Вас про будь-які зміни, опублікувавши нові Умови на цій сторінці.</p>
<p>Ми повідомимо Вас електронною поштою та/або через помітне сповіщення на Сервісі до того, як зміни набудуть чинності, і оновимо дату "Останнє оновлення" угорі цих Умов.</p>
<p>Рекомендуємо періодично переглядати ці Умови для ознайомлення зі змінами. Зміни до цих Умов набувають чинності після їх публікації на цій сторінці.</p>

<h2>Контакти</h2>
<p>Якщо у Вас є запитання щодо цих Умов використання, Ви можете зв’язатися з Нами:</p>
<ul>
<li>Електронною поштою: develop@gmail.com</li>
<li>За номером телефону: +380 99 999 99 99</li>
</ul>
`
// ---------------------------------------------

const TermsPage: React.FC = () => {
  const theme = useTheme(); 

  return (
    <Layout>
      <Container
        maxWidth="md" 
        sx={{
          mt: 4,
          mb: 4,
          display: 'flex',
          justifyContent: 'center',
        }}>
        <Paper
          elevation={3}
          sx={{
            p: { xs: 2, sm: 3, md: 4 }, 
            width: '100%',
            bgcolor: '#303030',
            color: theme.palette.mode === 'dark' ? theme.palette.text.primary : theme.palette.text.secondary, 
            textAlign: 'left', 
            borderRadius: '0.75rem', 

 
            '& h1': {
              ...theme.typography.h4, 
              color: theme.palette.text.primary, 
              fontWeight: 600,
              marginBottom: theme.spacing(2),
              textAlign: 'center', 
            },
            '& h2': {
              ...theme.typography.h5, 
              color: theme.palette.text.primary,
              fontWeight: 600,
              marginTop: theme.spacing(4), 
              marginBottom: theme.spacing(1.5),
              borderBottom: `1px solid ${theme.palette.divider}`, 
              paddingBottom: theme.spacing(0.5),
            },
            '& h3': {
              ...theme.typography.h6, 
              color: theme.palette.text.primary,
              fontWeight: 500,
              marginTop: theme.spacing(3),
              marginBottom: theme.spacing(1),
            },
             '& h4': { 
              ...theme.typography.subtitle1,
              color: theme.palette.text.primary,
              fontWeight: 'bold',
              marginTop: theme.spacing(2.5),
              marginBottom: theme.spacing(0.5),
            },
            '& p': {
              ...theme.typography.body1,
              color: theme.palette.text.primary, 
              lineHeight: 1.7, 
              marginBottom: theme.spacing(2), 
            },
            '& ul': {
              listStyleType: 'disc', 
              paddingLeft: theme.spacing(4), 
              marginBottom: theme.spacing(2),
              color: theme.palette.text.primary,
            },
            '& li': {
              marginBottom: theme.spacing(1.5), 
              '& p': { 
                marginBottom: theme.spacing(0.5),
              },
            },
            '& a': {
              color: theme.palette.primary.main, 
              textDecoration: 'underline',
              '&:hover': {
                textDecoration: 'none',
              },
            },
            '& strong': {
              fontWeight: theme.typography.fontWeightBold, 
              color: theme.palette.text.primary, 
            },

          }}>
          <Box dangerouslySetInnerHTML={{ __html: termsOfServiceHtml }} />
        </Paper>
      </Container>
    </Layout>
  );
};

export default TermsPage;