import React from 'react';
import Container from '@mui/material/Container';
import Paper from '@mui/material/Paper';
import Box from '@mui/material/Box';
import Layout from '../../shared/components/Layout';
import { useTheme } from '@mui/material/styles';


const privacyPolicyHtml = `
<h1>Політика Конфіденційності</h1>
<p>Останнє оновлення: 01 травня 2025</p>
<p>Ця Політика Конфіденційності описує Наші політики та процедури щодо збору, використання та розкриття Вашої інформації під час використання Вами Сервісу, а також повідомляє Вас про Ваші права на конфіденційність та про те, як закон захищає Вас.</p>
<p>Ми використовуємо Ваші Персональні дані для надання та покращення Сервісу. Використовуючи Сервіс, Ви погоджуєтесь на збір та використання інформації відповідно до цієї Політики Конфіденційності.</p>
<h2>Тлумачення та Визначення</h2>
<h3>Тлумачення</h3>
<p>Слова, початкова літера яких написана з великої літери, мають значення, визначені за наступних умов. Наведені нижче визначення мають однакове значення незалежно від того, чи вживаються вони в однині чи в множині.</p>
<h3>Визначення</h3>
<p>Для цілей цієї Політики Конфіденційності:</p>
<ul>
<li>
<p><strong>Обліковий запис</strong> означає унікальний обліковий запис, створений для Вас для доступу до нашого Сервісу або його частин.</p>
</li>
<li>
<p><strong>Афілійована особа</strong> означає юридичну особу, яка контролює, контролюється або перебуває під спільним контролем зі стороною, де "контроль" означає володіння 50% або більше акцій, пайових часток або інших цінних паперів, що дають право голосу при обранні директорів або іншого керівного органу.</p>
</li>
<li>
<p><strong>Компанія</strong> (що іменується в цій Угоді як "Компанія", "Ми", "Нас" або "Наш") відноситься до MovieHub.</p>
</li>
<li>
<p><strong>Файли cookie</strong> – це невеликі файли, які розміщуються на Вашому комп’ютері, мобільному пристрої чи будь-якому іншому пристрої веб-сайтом і містять деталі Вашої історії переглядів на цьому веб-сайті серед багатьох інших варіантів їх використання.</p>
</li>
<li>
<p><strong>Країна</strong> відноситься до: Україна</p>
</li>
<li>
<p><strong>Пристрій</strong> означає будь-який пристрій, який може отримати доступ до Сервісу, наприклад комп'ютер, мобільний телефон або цифровий планшет.</p>
</li>
<li>
<p><strong>Персональні дані</strong> – це будь-яка інформація, що стосується ідентифікованої або ідентифікованої фізичної особи.</p>
</li>
<li>
<p><strong>Сервіс</strong> відноситься до Веб-сайту.</p>
</li>
<li>
<p><strong>Постачальник послуг</strong> означає будь-яку фізичну або юридичну особу, яка обробляє дані від імені Компанії. Це стосується сторонніх компаній або фізичних осіб, найнятих Компанією для сприяння Сервісу, надання Сервісу від імені Компанії, виконання послуг, пов’язаних із Сервісом, або для допомоги Компанії в аналізі використання Сервісу.</p>
</li>
<li>
<p><strong>Дані про використання</strong> відносяться до даних, зібраних автоматично, або згенерованих під час використання Сервісу, або з самої інфраструктури Сервісу (наприклад, тривалість відвідування сторінки).</p>
</li>
<li>
<p><strong>Веб-сайт</strong> відноситься до MovieHub, доступного за адресою <a href="http://localhost:5173/" rel="external nofollow noopener" target="_blank">http://localhost:5173/</a></p>
</li>
<li>
<p><strong>Ви</strong> означає фізичну особу, яка отримує доступ або використовує Сервіс, або компанію чи іншу юридичну особу, від імені якої така фізична особа отримує доступ або використовує Сервіс, залежно від обставин.</p>
</li>
</ul>
<h2>Збір та Використання Ваших Персональних Даних</h2>
<h3>Типи Зібраних Даних</h3>
<h4>Персональні Дані</h4>
<p>Під час використання Нашого Сервісу Ми можемо попросити Вас надати Нам певну особисту інформацію, яка може бути використана для зв'язку з Вами або Вашої ідентифікації. Особиста інформація може включати, але не обмежується:</p>
<ul>
<li>
<p>Адреса електронної пошти</p>
</li>
<li>
<p>Ім'я та прізвище</p>
</li>
<li>
<p>Дані про використання</p>
</li>
</ul>
<h4>Дані про Використання</h4>
<p>Дані про використання збираються автоматично під час використання Сервісу.</p>
<p>Дані про використання можуть включати таку інформацію, як адреса Інтернет-протоколу Вашого Пристрою (наприклад, IP-адреса), тип браузера, версія браузера, сторінки нашого Сервісу, які Ви відвідуєте, час і дата Вашого візиту, час, проведений на цих сторінках, унікальні ідентифікатори пристроїв та інші діагностичні дані.</p>
<p>Коли Ви отримуєте доступ до Сервісу за допомогою мобільного пристрою, Ми можемо автоматично збирати певну інформацію, включаючи, але не обмежуючись, тип мобільного пристрою, який Ви використовуєте, унікальний ідентифікатор Вашого мобільного пристрою, IP-адресу Вашого мобільного пристрою, Вашу мобільну операційну систему, тип мобільного Інтернет-браузера, який Ви використовуєте, унікальні ідентифікатори пристроїв та інші діагностичні дані.</p>
<p>Ми також можемо збирати інформацію, яку Ваш браузер надсилає щоразу, коли Ви відвідуєте наш Сервіс, або коли Ви отримуєте доступ до Сервісу за допомогою мобільного пристрою.</p>
<h4>Технології Відстеження та Файли Cookie</h4>
<p>Ми використовуємо файли cookie та подібні технології відстеження для відстеження активності на Нашому Сервісі та зберігання певної інформації. Використовувані технології відстеження включають маяки, теги та скрипти для збору та відстеження інформації, а також для покращення та аналізу Нашого Сервісу. Технології, які ми використовуємо, можуть включати:</p>
<ul>
<li><strong>Файли Cookie або Файли Cookie Браузера.</strong> Файл cookie – це невеликий файл, розміщений на Вашому Пристрої. Ви можете налаштувати свій браузер так, щоб він відмовлявся від усіх файлів cookie або повідомляв, коли файл cookie надсилається. Однак, якщо Ви не приймаєте файли cookie, Ви можете не мати змоги використовувати деякі частини нашого Сервісу. Якщо Ви не змінили налаштування свого браузера так, щоб він відмовлявся від файлів cookie, наш Сервіс може використовувати файли cookie.</li>
<li><strong>Веб-маяки.</strong> Певні розділи нашого Сервісу та наші електронні листи можуть містити невеликі електронні файли, відомі як веб-маяки (також звані прозорими GIF-файлами, піксельними тегами та однопіксельними GIF-файлами), які дозволяють Компанії, наприклад, підраховувати користувачів, які відвідали ці сторінки або відкрили електронний лист, та для іншої пов’язаної статистики веб-сайту (наприклад, запис популярності певного розділу та перевірка цілісності системи та сервера).</li>
</ul>
<p>Файли cookie можуть бути "Постійними" або "Сесійними". Постійні файли cookie залишаються на Вашому персональному комп’ютері або мобільному пристрої, коли Ви переходите в автономний режим, тоді як Сесійні файли cookie видаляються, як тільки Ви закриваєте веб-браузер. Ви можете дізнатися більше про файли cookie у статті на <a href="https://www.termsfeed.com/blog/cookies/#What_Are_Cookies" target="_blank" rel="noopener noreferrer">веб-сайті TermsFeed</a>.</p>
<p>Ми використовуємо як Сесійні, так і Постійні файли cookie для цілей, викладених нижче:</p>
<ul>
<li>
<p><strong>Необхідні / Обов'язкові Файли Cookie</strong></p>
<p>Тип: Сесійні Файли Cookie</p>
<p>Адмініструються: Нами</p>
<p>Призначення: Ці файли cookie необхідні для надання Вам послуг, доступних через Веб-сайт, та для того, щоб Ви могли використовувати деякі його функції. Вони допомагають автентифікувати користувачів та запобігати шахрайському використанню облікових записів користувачів. Без цих файлів cookie послуги, які Ви запитували, не можуть бути надані, і Ми використовуємо ці файли cookie лише для надання Вам цих послуг.</p>
</li>
<li>
<p><strong>Файли Cookie Політики / Повідомлення про Прийняття Файлів Cookie</strong></p>
<p>Тип: Постійні Файли Cookie</p>
<p>Адмініструються: Нами</p>
<p>Призначення: Ці файли cookie визначають, чи погодилися користувачі на використання файлів cookie на Веб-сайті.</p>
</li>
<li>
<p><strong>Файли Cookie Функціональності</strong></p>
<p>Тип: Постійні Файли Cookie</p>
<p>Адмініструються: Нами</p>
<p>Призначення: Ці файли cookie дозволяють нам запам’ятовувати вибір, який Ви робите під час використання Веб-сайту, наприклад, запам’ятовування Ваших даних для входу або мовних уподобань. Метою цих файлів cookie є надання Вам більш персоналізованого досвіду та уникнення необхідності повторного введення Ваших уподобань щоразу, коли Ви використовуєте Веб-сайт.</p>
</li>
</ul>
<p>Для отримання додаткової інформації про файли cookie, які ми використовуємо, та Ваш вибір щодо файлів cookie, будь ласка, відвідайте нашу Політику щодо файлів cookie або розділ Файли cookie нашої Політики Конфіденційності.</p>
<h3>Використання Ваших Персональних Даних</h3>
<p>Компанія може використовувати Персональні дані для таких цілей:</p>
<ul>
<li>
<p><strong>Для надання та підтримки нашого Сервісу</strong>, включаючи моніторинг використання нашого Сервісу.</p>
</li>
<li>
<p><strong>Для керування Вашим Обліковим записом:</strong> для керування Вашою реєстрацією як користувача Сервісу. Надані Вами Персональні дані можуть надати Вам доступ до різних функціональних можливостей Сервісу, доступних Вам як зареєстрованому користувачеві.</p>
</li>
<li>
<p><strong>Для виконання договору:</strong> розробка, дотримання та виконання договору купівлі продуктів, товарів або послуг, які Ви придбали, або будь-якого іншого договору з Нами через Сервіс.</p>
</li>
<li>
<p><strong>Для зв'язку з Вами:</strong> Щоб зв’язатися з Вами електронною поштою, телефонними дзвінками, SMS або іншими еквівалентними формами електронного зв’язку, такими як push-сповіщення мобільного додатка щодо оновлень або інформаційних повідомлень, пов’язаних із функціональними можливостями, продуктами чи договірними послугами, включаючи оновлення безпеки, коли це необхідно або розумно для їх реалізації.</p>
</li>
<li>
<p><strong>Для надання Вам</strong> новин, спеціальних пропозицій та загальної інформації про інші товари, послуги та події, які ми пропонуємо, подібні до тих, які ви вже придбали або про які запитували, якщо Ви не відмовилися від отримання такої інформації.</p>
</li>
<li>
<p><strong>Для керування Вашими запитами:</strong> Для розгляду та керування Вашими запитами до Нас.</p>
</li>
<li>
<p><strong>Для передачі бізнесу:</strong> Ми можемо використовувати Вашу інформацію для оцінки або проведення злиття, відчуження, реструктуризації, реорганізації, ліквідації або іншого продажу чи передачі частини або всіх Наших активів, як у якості діючого підприємства, так і в рамках процедури банкрутства, ліквідації чи подібної процедури, в якій Персональні дані, що зберігаються у Нас про користувачів нашого Сервісу, є серед переданих активів.</p>
</li>
<li>
<p><strong>Для інших цілей</strong>: Ми можемо використовувати Вашу інформацію для інших цілей, таких як аналіз даних, виявлення тенденцій використання, визначення ефективності наших рекламних кампаній та для оцінки та покращення нашого Сервісу, продуктів, послуг, маркетингу та Вашого досвіду.</p>
</li>
</ul>
<p>Ми можемо ділитися Вашою особистою інформацією в таких ситуаціях:</p>
<ul>
<li><strong>З Постачальниками послуг:</strong> Ми можемо ділитися Вашою особистою інформацією з Постачальниками послуг для моніторингу та аналізу використання нашого Сервісу, для зв’язку з Вами.</li>
<li><strong>Для передачі бізнесу:</strong> Ми можемо ділитися або передавати Вашу особисту інформацію у зв'язку з будь-яким злиттям, продажем активів Компанії, фінансуванням або придбанням всього або частини Нашого бізнесу іншою компанією, або під час переговорів про це.</li>
<li><strong>З Афілійованими особами:</strong> Ми можемо ділитися Вашою інформацією з Нашими афілійованими особами, у такому випадку ми вимагатимемо від цих афілійованих осіб дотримуватися цієї Політики Конфіденційності. Афілійовані особи включають Нашу материнську компанію та будь-які інші дочірні компанії, партнерів по спільним підприємствам або інші компанії, які ми контролюємо або які перебувають під спільним з нами контролем.</li>
<li><strong>З діловими партнерами:</strong> Ми можемо ділитися Вашою інформацією з Нашими діловими партнерами, щоб пропонувати Вам певні продукти, послуги чи рекламні акції.</li>
<li><strong>З іншими користувачами:</strong> коли Ви ділитеся особистою інформацією або іншим чином взаємодієте у загальнодоступних місцях з іншими користувачами, така інформація може бути переглянута всіма користувачами та може бути публічно поширена за межами Сервісу.</li>
<li><strong>З Вашої згоди</strong>: Ми можемо розкривати Вашу особисту інформацію для будь-яких інших цілей за Вашою згодою.</li>
</ul>
<h3>Зберігання Ваших Персональних Даних</h3>
<p>Компанія зберігатиме Ваші Персональні дані лише стільки часу, скільки це необхідно для цілей, викладених у цій Політиці Конфіденційності. Ми зберігатимемо та використовуватимемо Ваші Персональні дані в обсязі, необхідному для дотримання наших юридичних зобов'язань (наприклад, якщо ми зобов'язані зберігати ваші дані для дотримання чинного законодавства), вирішення суперечок та забезпечення виконання наших юридичних угод та політик.</p>
<p>Компанія також зберігатиме Дані про використання для цілей внутрішнього аналізу. Дані про використання, як правило, зберігаються протягом коротшого періоду часу, за винятком випадків, коли ці дані використовуються для посилення безпеки або покращення функціональності Нашого Сервісу, або якщо ми юридично зобов'язані зберігати ці дані протягом довших періодів часу.</p>
<h3>Передача Ваших Персональних Даних</h3>
<p>Ваша інформація, включаючи Персональні дані, обробляється в операційних офісах Компанії та в будь-яких інших місцях, де знаходяться сторони, залучені до обробки. Це означає, що ця інформація може передаватися та зберігатися на комп’ютерах, розташованих за межами Вашого штату, провінції, країни чи іншої державної юрисдикції, де закони про захист даних можуть відрізнятися від законів Вашої юрисдикції.</p>
<p>Ваша згода з цією Політикою Конфіденційності з наступним наданням такої інформації означає Вашу згоду на таку передачу.</p>
<p>Компанія вживатиме всіх розумно необхідних заходів для забезпечення безпечного поводження з Вашими даними відповідно до цієї Політики Конфіденційності, і жодна передача Ваших Персональних Даних не відбуватиметься до організації чи країни, якщо там не будуть запроваджені належні засоби контролю, включаючи безпеку Ваших даних та іншої особистої інформації.</p>
<h3>Видалення Ваших Персональних Даних</h3>
<p>Ви маєте право видалити або вимагати, щоб Ми допомогли у видаленні Персональних даних, які Ми зібрали про Вас.</p>
<p>Наш Сервіс може надати Вам можливість видаляти певну інформацію про Вас безпосередньо з Сервісу.</p>
<p>Ви можете оновлювати, змінювати або видаляти свою інформацію в будь-який час, увійшовши до Свого Облікового запису, якщо він у Вас є, та відвідавши розділ налаштувань облікового запису, який дозволяє керувати Вашою особистою інформацією. Ви також можете зв'язатися з Нами, щоб вимагати доступ, виправлення або видалення будь-якої особистої інформації, яку Ви нам надали.</p>
<p>Однак зверніть увагу, що Нам може знадобитися зберегти певну інформацію, якщо ми маємо юридичне зобов'язання або законну підставу для цього.</p>
<h3>Розкриття Ваших Персональних Даних</h3>
<h4>Ділові Операції</h4>
<p>Якщо Компанія бере участь у злитті, придбанні або продажу активів, Ваші Персональні дані можуть бути передані. Ми надішлемо повідомлення до того, як Ваші Персональні дані будуть передані та стануть предметом іншої Політики Конфіденційності.</p>
<h4>Правоохоронні органи</h4>
<p>За певних обставин Компанія може бути зобов'язана розкрити Ваші Персональні дані, якщо це вимагається законом або у відповідь на дійсні запити державних органів (наприклад, суду чи урядової установи).</p>
<h4>Інші юридичні вимоги</h4>
<p>Компанія може розкрити Ваші Персональні дані добросовісно вважаючи, що такі дії необхідні для:</p>
<ul>
<li>Дотримання юридичного зобов'язання</li>
<li>Захисту прав або власності Компанії</li>
<li>Запобігання або розслідування можливих правопорушень у зв'язку з Сервісом</li>
<li>Захисту особистої безпеки Користувачів Сервісу або громадськості</li>
<li>Захисту від юридичної відповідальності</li>
</ul>
<h3>Безпека Ваших Персональних Даних</h3>
<p>Безпека Ваших Персональних даних важлива для Нас, але пам’ятайте, що жоден метод передачі через Інтернет або метод електронного зберігання не є на 100% безпечним. Хоча Ми прагнемо використовувати комерційно прийнятні засоби для захисту Ваших Персональних даних, Ми не можемо гарантувати їх абсолютну безпеку.</p>
<h2>Конфіденційність Дітей</h2>
<p>Наш Сервіс не призначений для осіб молодше 13 років. Ми свідомо не збираємо особисту інформацію від осіб молодше 13 років. Якщо Ви є батьком або опікуном і знаєте, що Ваша дитина надала Нам Персональні дані, будь ласка, зв’яжіться з Нами. Якщо Нам стане відомо, що Ми зібрали Персональні дані від будь-кого молодше 13 років без підтвердження батьківської згоди, Ми вживаємо заходів для видалення цієї інформації з Наших серверів.</p>
<p>Якщо Нам потрібно покладатися на згоду як на правову підставу для обробки Вашої інформації, а Ваша країна вимагає згоди батьків, Ми можемо вимагати згоди Ваших батьків перед тим, як збирати та використовувати цю інформацію.</p>
<h2>Посилання на Інші Веб-сайти</h2>
<p>Наш Сервіс може містити посилання на інші веб-сайти, які не керуються Нами. Якщо Ви натиснете на посилання третьої сторони, Ви будете перенаправлені на сайт цієї третьої сторони. Ми настійно рекомендуємо Вам ознайомитися з Політикою Конфіденційності кожного сайту, який Ви відвідуєте.</p>
<p>Ми не контролюємо та не несемо відповідальності за вміст, політику конфіденційності чи практику будь-яких сторонніх сайтів чи служб.</p>
<h2>Зміни до Цієї Політики Конфіденційності</h2>
<p>Ми можемо час від часу оновлювати Нашу Політику Конфіденційності. Ми повідомимо Вас про будь-які зміни, розмістивши нову Політику Конфіденційності на цій сторінці.</p>
<p>Ми повідомимо Вас електронною поштою та/або через помітне повідомлення на Нашому Сервісі до того, як зміни набудуть чинності, та оновимо дату "Останнього оновлення" у верхній частині цієї Політики Конфіденційності.</p>
<p>Рекомендуємо періодично переглядати цю Політику Конфіденційності на предмет будь-яких змін. Зміни до цієї Політики Конфіденційності набувають чинності з моменту їх розміщення на цій сторінці.</p>
<h2>Зв'яжіться з Нами</h2>
<p>Якщо у вас виникли запитання щодо цієї Політики Конфіденційності, Ви можете зв'язатися з нами:</p>
<ul>
<li>
<p>Електронною поштою: develop@gmail.com</p>
</li>
<li>
<p>За номером телефону: +380 99 999 99 99</p>
</li>
</ul>
`;

const PrivacyPage: React.FC = () => {
  const theme = useTheme();

  return (
    <Layout>
      <Container

        maxWidth="md"
        sx={{
          mt: 4,
          mb: 4,
          display: 'flex',
          justifyContent: 'center',
        }}>
        <Paper
          elevation={3}
          sx={{
            p: { xs: 2, sm: 3, md: 4 },
            width: '100%',
            bgcolor: '#303030',
            color: 'text.primary',
            textAlign: 'left',
            borderRadius: '0.75rem',

            '& h1': {
              ...theme.typography.h4,
              color: theme.palette.text.primary,
              fontWeight: 600,
              marginBottom: theme.spacing(2),
              textAlign: 'center',
            },
            '& h2': {
              ...theme.typography.h5,
              color: theme.palette.text.primary,
              fontWeight: 600,
              marginTop: theme.spacing(4),
              marginBottom: theme.spacing(1.5),
              borderBottom: `1px solid ${theme.palette.divider}`,
              paddingBottom: theme.spacing(0.5),
            },
            '& h3': {
              ...theme.typography.h6,
              color: theme.palette.text.primary,
              fontWeight: 500,
              marginTop: theme.spacing(3),
              marginBottom: theme.spacing(1),
            },
             '& h4': {
              ...theme.typography.subtitle1,
              color: theme.palette.text.primary,
              fontWeight: 'bold',
              marginTop: theme.spacing(2.5),
              marginBottom: theme.spacing(0.5),
            },
            '& p': {
              ...theme.typography.body1,
              color: theme.palette.text.primary,
              lineHeight: 1.7,
              marginBottom: theme.spacing(2),
            },
            '& ul': {
              listStyleType: 'disc',
              paddingLeft: theme.spacing(4),
              marginBottom: theme.spacing(2),
              color: theme.palette.text.primary,
            },
            '& li': {
              marginBottom: theme.spacing(1.5),
              '& p': {
                marginBottom: theme.spacing(0.5),
              },
            },
            '& a': {
              color: theme.palette.primary.main,
              textDecoration: 'underline',
              '&:hover': {
                textDecoration: 'none',
              },
            },
            '& strong': {
              fontWeight: theme.typography.fontWeightBold,
              color: theme.palette.text.primary,
            },

          }}>
          <Box dangerouslySetInnerHTML={{ __html: privacyPolicyHtml }} />
        </Paper>
      </Container>
    </Layout>
  );
};

export default PrivacyPage;